<!-- dflook/terraform-github-actions backend_type= workspace=github_pr_comment_refactor backend=1e1e90cff6bc7d0c97ce0867833a8544f89d713c19bd67b029143730fef61fa1 -->Terraform plan in __tests/target__ in the __github_pr_comment_refactor__ workspace
Targeting resources: `random_string.count[0]`
With variables: `length = 5`
    <detailsFalse>
    <summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

    ```hcl
    Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_string.count[0] will be created
  + resource "random_string" "count" {
      + id          = (known after apply)
      + length      = 5
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + count = (known after apply)
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the
│ result of this plan may not represent all of the changes requested by the
│ current configuration.
│ 		
│ The -target option is not for routine use, and is provided only for
│ exceptional situations such as recovering from errors or mistakes, or when
│ Terraform specifically suggests to use it as part of an error message.
╵
    ```
    </details>
    
:memo: Plan generated in [Test plan target and replace #160](https://github.com/dflook/terraform-github-actions/actions/runs/1878360827)